/*-----------------------------------------------------
题目：809*??=800*??+9*??+1 其中??代表的两位数,8*??的结果为两位
数，9*??的结果为3位数。求??代表的两位数，及809*??后的结果。
备注：看不懂题目，代码也看不懂。不懂这题是做什么的
-------------------------------------------------------*/

#include <stdio.h>

void output(long b, long i)
{
	printf("\n%ld/%ld=809*%ld+%ld\n", b, i, i, b % i);
}

int main(void)
{
	long a, b, i;
	a = 809;
	for (i = 10; i < 100; i++)
	{
		b = i * a + 1;
		if (b >= 1000 && b <= 10000 && 8 * i < 100 && 9 * i >= 100)
			output(b, i);
	}
	return 0;
}
